In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
l1 = [1, 2, 3, 4, 5, 6]
labels = ['a', 'b', 'c', 'd', 'e', 'f']
d1 = {"A":10, "B":20, "C":30, "D":40, "E":50}

In [3]:
s1 = pd.Series(l1)
s1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
s1[4]

5

In [5]:
s2 = pd.Series(labels)
s2

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [6]:
s2[4]

'e'

In [7]:
s3 = pd.Series(data=l1, index=labels)
s3

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [8]:
s3['a']

1

In [9]:
s3[0]

1

In [10]:
pd.Series(d1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

# DataFrame

In [11]:
arr = np.random.randint(low=1, high=100, size=(5, 6))
arr

array([[55, 53, 65,  2, 56, 33],
       [50, 26, 87,  5, 79, 44],
       [ 7, 73, 51, 32,  6, 19],
       [21, 28, 26,  5, 43, 64],
       [22, 58, 71, 18, 67, 47]])

In [12]:
type(arr)

numpy.ndarray

In [13]:
pd.DataFrame(arr)

    0   1   2   3   4   5
0  55  53  65   2  56  33
1  50  26  87   5  79  44
2   7  73  51  32   6  19
3  21  28  26   5  43  64
4  22  58  71  18  67  47

In [14]:
df = pd.DataFrame(arr, index=["A", "B", "C", "D", "E"], columns=["U", "V", "W", "X", "Y", "Z"])
df

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
B  50  26  87   5  79  44
C   7  73  51  32   6  19
D  21  28  26   5  43  64
E  22  58  71  18  67  47

In [15]:
type(df)

pandas.core.frame.DataFrame

## Grabbing Columns

In [16]:
df["X"]

A     2
B     5
C    32
D     5
E    18
Name: X, dtype: int64

In [17]:
df[["X", "Z", "V"]]

    X   Z   V
A   2  33  53
B   5  44  26
C  32  19  73
D   5  64  28
E  18  47  58

## Grabbing Rows

In [18]:
df.loc["C"]

U     7
V    73
W    51
X    32
Y     6
Z    19
Name: C, dtype: int64

In [19]:
df.loc[["A", "B", "E"]]

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
B  50  26  87   5  79  44
E  22  58  71  18  67  47

In [20]:
df.iloc[2]

U     7
V    73
W    51
X    32
Y     6
Z    19
Name: C, dtype: int64

## Adding a New Column

In [21]:
df

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
B  50  26  87   5  79  44
C   7  73  51  32   6  19
D  21  28  26   5  43  64
E  22  58  71  18  67  47

In [22]:
df['New'] = [10, 20, 30, 40, 50]

In [23]:
df

    U   V   W   X   Y   Z  New
A  55  53  65   2  56  33   10
B  50  26  87   5  79  44   20
C   7  73  51  32   6  19   30
D  21  28  26   5  43  64   40
E  22  58  71  18  67  47   50

In [24]:
df['New'] = [100, 200, 300, 400, 500]

In [25]:
df

    U   V   W   X   Y   Z  New
A  55  53  65   2  56  33  100
B  50  26  87   5  79  44  200
C   7  73  51  32   6  19  300
D  21  28  26   5  43  64  400
E  22  58  71  18  67  47  500

## Deleting a Column

In [26]:
df

    U   V   W   X   Y   Z  New
A  55  53  65   2  56  33  100
B  50  26  87   5  79  44  200
C   7  73  51  32   6  19  300
D  21  28  26   5  43  64  400
E  22  58  71  18  67  47  500

In [27]:
df.drop('New', axis=1)

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
B  50  26  87   5  79  44
C   7  73  51  32   6  19
D  21  28  26   5  43  64
E  22  58  71  18  67  47

In [28]:
df.drop('New', axis=1, inplace=True)

In [29]:
df

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
B  50  26  87   5  79  44
C   7  73  51  32   6  19
D  21  28  26   5  43  64
E  22  58  71  18  67  47

## Conditional Selection

In [30]:
df

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
B  50  26  87   5  79  44
C   7  73  51  32   6  19
D  21  28  26   5  43  64
E  22  58  71  18  67  47

In [31]:
df['X']

A     2
B     5
C    32
D     5
E    18
Name: X, dtype: int64

In [32]:
df['X'] % 2 == 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [33]:
df[df['X'] % 2 == 0]

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
C   7  73  51  32   6  19
E  22  58  71  18  67  47

In [34]:
df[df['X'] % 2 == 0]['Y']

A    56
C     6
E    67
Name: Y, dtype: int64

In [35]:
(df['X'] % 2 == 0) & (df['X'] > 50)

A    False
B    False
C    False
D    False
E    False
Name: X, dtype: bool

In [36]:
df[(df['X'] % 2 == 0) & (df['X'] > 50)]

Empty DataFrame
Columns: [U, V, W, X, Y, Z]
Index: []

## Setting an Index

In [37]:
df

    U   V   W   X   Y   Z
A  55  53  65   2  56  33
B  50  26  87   5  79  44
C   7  73  51  32   6  19
D  21  28  26   5  43  64
E  22  58  71  18  67  47

In [38]:
df.reset_index()

  index   U   V   W   X   Y   Z
0     A  55  53  65   2  56  33
1     B  50  26  87   5  79  44
2     C   7  73  51  32   6  19
3     D  21  28  26   5  43  64
4     E  22  58  71  18  67  47

In [39]:
df.reset_index(inplace=True)

In [40]:
df

  index   U   V   W   X   Y   Z
0     A  55  53  65   2  56  33
1     B  50  26  87   5  79  44
2     C   7  73  51  32   6  19
3     D  21  28  26   5  43  64
4     E  22  58  71  18  67  47

In [41]:
df['States'] = "PB RJ DL CHD J&K".split()

In [42]:
"PB RJ DL CHD J&K".split()

['PB', 'RJ', 'DL', 'CHD', 'J&K']

In [43]:
df

  index   U   V   W   X   Y   Z States
0     A  55  53  65   2  56  33     PB
1     B  50  26  87   5  79  44     RJ
2     C   7  73  51  32   6  19     DL
3     D  21  28  26   5  43  64    CHD
4     E  22  58  71  18  67  47    J&K

In [44]:
df.set_index('States')

       index   U   V   W   X   Y   Z
States
PB         A  55  53  65   2  56  33
RJ         B  50  26  87   5  79  44
DL         C   7  73  51  32   6  19
CHD        D  21  28  26   5  43  64
J&K        E  22  58  71  18  67  47

## Missing Values

In [45]:
d = {"A":[1, 2, 3, np.nan], 
    "B":[5, np.nan, np.nan, np.nan],
    "C":[10, 20, 30, 40], 
    "D":[np.nan, np.nan, np.nan, np.nan]}

df = pd.DataFrame(d)
df

     A    B   C   D
0  1.0  5.0  10 NaN
1  2.0  NaN  20 NaN
2  3.0  NaN  30 NaN
3  NaN  NaN  40 NaN

In [46]:
df.isnull()

       A      B      C     D
0  False  False  False  True
1  False   True  False  True
2  False   True  False  True
3   True   True  False  True

In [47]:
df.isnull().sum()

A    1
B    3
C    0
D    4
dtype: int64

In [48]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [49]:
df.dropna(axis=1, thresh=2)

     A   C
0  1.0  10
1  2.0  20
2  3.0  30
3  NaN  40

In [50]:
df

     A    B   C   D
0  1.0  5.0  10 NaN
1  2.0  NaN  20 NaN
2  3.0  NaN  30 NaN
3  NaN  NaN  40 NaN

In [51]:
df.fillna("FILL")

      A     B   C     D
0   1.0   5.0  10  FILL
1   2.0  FILL  20  FILL
2   3.0  FILL  30  FILL
3  FILL  FILL  40  FILL

In [52]:
df.fillna(df.mean())

     A    B   C   D
0  1.0  5.0  10 NaN
1  2.0  5.0  20 NaN
2  3.0  5.0  30 NaN
3  2.0  5.0  40 NaN

In [53]:
df.fillna(0)

     A    B   C    D
0  1.0  5.0  10  0.0
1  2.0  0.0  20  0.0
2  3.0  0.0  30  0.0
3  0.0  0.0  40  0.0

## Grouping

In [54]:
d = {"Company":["FB", "GOOGLE", "MICROSOFT", "FB", "GOOGLE", "FB", "MICROSOFT", "FB"],
    "Employee":["Sam", "Rachel", "Maddy", "Joe", "Srishti", "Shivay", "Pushpa", "Kirti"],
    "Sales":[1000, 500, 550, 2000, 890, 500, 350, 350]}

df = pd.DataFrame(d)
df

     Company Employee  Sales
0         FB      Sam   1000
1     GOOGLE   Rachel    500
2  MICROSOFT    Maddy    550
3         FB      Joe   2000
4     GOOGLE  Srishti    890
5         FB   Shivay    500
6  MICROSOFT   Pushpa    350
7         FB    Kirti    350

In [55]:
df.min()

Company      FB
Employee    Joe
Sales       350
dtype: object

In [56]:
df.max()

Company     MICROSOFT
Employee      Srishti
Sales            2000
dtype: object

In [57]:
grouped_df = df.groupby('Company')
grouped_df

In [58]:
grouped_df.min()

          Employee  Sales
Company
FB             Joe    350
GOOGLE      Rachel    500
MICROSOFT    Maddy    350

In [59]:
grouped_df.max()

          Employee  Sales
Company
FB          Shivay   2000
GOOGLE     Srishti    890
MICROSOFT   Pushpa    550

In [60]:
grouped_df.describe()

          Sales
          count   mean         std    min    25%    50%     75%     max
Company
FB          4.0  962.5  745.402576  350.0  462.5  750.0  1250.0  2000.0
GOOGLE      2.0  695.0  275.771645  500.0  597.5  695.0   792.5   890.0
MICROSOFT   2.0  450.0  141.421356  350.0  400.0  450.0   500.0   550.0

In [61]:
df.describe()

             Sales
count     8.000000
mean    767.500000
std     551.251822
min     350.000000
25%     462.500000
50%     525.000000
75%     917.500000
max    2000.000000

## Custom Functions

In [62]:
def give_bonus(sales):
    return sales + 100

In [63]:
df['Sales'].apply(give_bonus)

0    1100
1     600
2     650
3    2100
4     990
5     600
6     450
7     450
Name: Sales, dtype: int64

In [64]:
df['Sales'] = df['Sales'].apply(lambda sales : sales + 100)

In [65]:
df

     Company Employee  Sales
0         FB      Sam   1100
1     GOOGLE   Rachel    600
2  MICROSOFT    Maddy    650
3         FB      Joe   2100
4     GOOGLE  Srishti    990
5         FB   Shivay    600
6  MICROSOFT   Pushpa    450
7         FB    Kirti    450

## Joining

In [66]:
new_employee = pd.DataFrame({'Company':['GOOGLE'], 'Employee':['Kriti'], 'Sales':[5000]})
new_employee

  Company Employee  Sales
0  GOOGLE    Kriti   5000

In [67]:
df = pd.concat([df, new_employee])
df

     Company Employee  Sales
0         FB      Sam   1100
1     GOOGLE   Rachel    600
2  MICROSOFT    Maddy    650
3         FB      Joe   2100
4     GOOGLE  Srishti    990
5         FB   Shivay    600
6  MICROSOFT   Pushpa    450
7         FB    Kirti    450
0     GOOGLE    Kriti   5000

In [68]:
df.index.values[-1] = 8

In [69]:
df

     Company Employee  Sales
0         FB      Sam   1100
1     GOOGLE   Rachel    600
2  MICROSOFT    Maddy    650
3         FB      Joe   2100
4     GOOGLE  Srishti    990
5         FB   Shivay    600
6  MICROSOFT   Pushpa    450
7         FB    Kirti    450
8     GOOGLE    Kriti   5000

In [70]:
another_employee = pd.DataFrame({'Company':['INFOSYS'], 'Employee':['XYZ'], 'Gender':['M']})
another_employee

   Company Employee Gender
0  INFOSYS      XYZ      M

In [71]:
pd.concat([df, another_employee])

     Company Employee   Sales Gender
0         FB      Sam  1100.0    NaN
1     GOOGLE   Rachel   600.0    NaN
2  MICROSOFT    Maddy   650.0    NaN
3         FB      Joe  2100.0    NaN
4     GOOGLE  Srishti   990.0    NaN
5         FB   Shivay   600.0    NaN
6  MICROSOFT   Pushpa   450.0    NaN
7         FB    Kirti   450.0    NaN
8     GOOGLE    Kriti  5000.0    NaN
0    INFOSYS      XYZ     NaN      M

In [75]:
df.drop(1)

     Company Employee  Sales
0         FB      Sam   1100
2  MICROSOFT    Maddy    650
3         FB      Joe   2100
4     GOOGLE  Srishti    990
5         FB   Shivay    600
6  MICROSOFT   Pushpa    450
7         FB    Kirti    450
8     GOOGLE    Kriti   5000

In [78]:
df[df['Company'] == 'MICROSOFT'].index

Int64Index([2, 6], dtype='int64')

In [79]:
df.drop(df[df['Company'] == 'MICROSOFT'].indexwe)

  Company Employee  Sales
0      FB      Sam   1100
1  GOOGLE   Rachel    600
3      FB      Joe   2100
4  GOOGLE  Srishti    990
5      FB   Shivay    600
7      FB    Kirti    450
8  GOOGLE    Kriti   5000